app/controllers/galleries_controller.rb

  def find_containing_resource
    @photographer = Photographer.first #find(params[:photographer_id])
---
SELECT "photographers".* FROM "photographers" LIMIT 1

  def find_resource
    @gallery = @photographer.galleries.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."photographer_id" = 1 AND "galleries"."id" = ? LIMIT 1  [["id", "1"]]